app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:Followed_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    @user = Relationship.find(params[:id]).Followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "1"]]